In [1]:
#Importing some modules
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os

In [2]:
#Defining path and file to load
school_data_to_load=os.path.join("Resources","schools_complete.csv" )
student_data_to_load=os.path.join("Resources","students_complete.csv" )

In [3]:
# Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

In [4]:
# looking the data first
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [5]:
# looking the data first
student_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [6]:
# Combine the data into a single dataset.  
school = (pd.merge(student_data, school_data, how="left", 
                                 on=["school_name", "school_name"]))

In [7]:
# looking the data first
school.tail()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [8]:
#looking for shape
school.shape
print(f'The number of rows is:{school.shape[0]} and number of columns is: {school.shape[1]}')

The number of rows is:39170 and number of columns is: 11

In [9]:
#looking for dtypes and null value
school.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 39170 entries, 0 to 39169
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Student ID     39170 non-null  int64
 1   student_name   39170 non-null  object
 2   gender         39170 non-null  object
 3   grade          39170 non-null  object
 4   school_name    39170 non-null  object
 5   reading_score  39170 non-null  int64
 6   math_score     39170 non-null  int64
 7   School ID      39170 non-null  int64
 8   type           39170 non-null  object
 9   size           39170 non-null  int64
 10  budget         39170 non-null  int64
dtypes: int64(6), object(5)
memory usage: 3.6+ MB

In [10]:
#Describing the dataframe
school.describe()

,Student ID,reading_score,math_score,School ID,size,budget
count,39170.000000,39170.00000,39170.000000,39170.000000,39170.000000,3.917000e+04
mean,19584.500000,81.87784,78.985371,6.978172,3332.957110,2.117241e+06
std,11307.549359,10.23958,12.309968,4.444329,1323.914069,8.749987e+05
min,0.000000,63.00000,55.000000,0.000000,427.000000,2.480870e+05
25%,9792.250000,73.00000,69.000000,3.000000,1858.000000,1.081356e+06
50%,19584.500000,82.00000,79.000000,7.000000,2949.000000,1.910635e+06
75%,29376.750000,91.00000,89.000000,11.000000,4635.000000,3.022020e+06
max,39169.000000,99.00000,99.000000,14.000000,4976.000000,3.124928e+06

In [11]:
#columns name
school.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score', 'School ID', 'type', 'size', 'budget'],
      dtype='object')

In [12]:
#District Summary
tot_school=school.school_name.nunique()
tot_student=school['Student ID'].count()
tot_budget=(school.groupby('school_name')['budget'].sum()
        /school.groupby('school_name')['budget'].count()).sum()
avg_math=school.math_score.mean()
avg_read=school.reading_score.mean()
perc_math=(school.loc[school.math_score >=70, 'Student ID'].count()/tot_student)*100
perc_read=(school.loc[school.reading_score >=70, 'Student ID'].count()/tot_student)*100
perc_both=((school.loc[(school.reading_score >=70) & (school.math_score >=70) ,'Student ID']
            .count()/tot_student)*100)

district_summary=pd.DataFrame({'Total Schools':[tot_school],
             'Total Students':[tot_student],
             'Total Budget':[tot_budget],
             'Average Math Score':[avg_math],
             'Average Reading Score':[avg_read],
             '% Passing Math':[perc_math],
             '% Passing Reading':[perc_read],          
             '% Overall Passing':[perc_both]})

district_summary['Total Budget']=district_summary['Total Budget'].map('${:,.2f}'.format)
district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,"$24,649,428.00",78.985371,81.87784,74.980853,85.805463,65.172326

In [13]:
group=school.groupby('school_name')
school_type=group.agg({'type': lambda x : x.unique()})
school_type

                           type
school_name
Bailey High School     District
Cabrera High School     Charter
Figueroa High School   District
Ford High School       District
Griffin High School     Charter
Hernandez High School  District
Holden High School      Charter
Huang High School      District
Johnson High School    District
Pena High School        Charter
Rodriguez High School  District
Shelton High School     Charter
Thomas High School      Charter
Wilson High School      Charter
Wright High School      Charter

In [16]:
#School Summary
group=school.groupby('school_name')
school_summary=(group.agg({'type': lambda x : x.unique(),
                        'Student ID': 'count',
                       'math_score': "mean",
                       'reading_score': 'mean'}))

total_budget=group['budget'].sum()/group['budget'].count()
per_stu_budget=total_budget/total_students


math_pass=school[school.math_score >=70]
perc_math_score=(math_pass.groupby('school_name')['math_score'].count()/group['math_score'].count())*100

read_pass=school.loc[school.reading_score >=70, ['school_name','reading_score']]
perc_read_score=(read_pass.groupby('school_name')['reading_score'].count()/group['reading_score'].count())*100

overall_pass=school[(school.reading_score >=70) & (school.math_score >=70)]
perc_overall_score=(overall_pass.groupby('school_name')['reading_score'].count()/group['reading_score'].count())*100


school_summary['Per Student Budget']=per_stu_budget
school_summary["% Passing Math"]=perc_math_score
school_summary["% Passing Reading"]=perc_read_score
school_summary["% Overall Passing"]=perc_overall_score

(school_summary.rename(columns={'type': "School Type",
                               'math_score': 'Average Math Score',
                               'reading_score': 'Average Reading Score'}, inplace=True))
school_summary

,School Type,Student ID,Average Math Score,Average Reading Score,Per Student Budget,% Passing Math,% Passing Reading,% Overall Passing
school_name,,,,,,,,
Bailey High School,District,4976,77.048432,81.033963,628.0,66.680064,81.933280,54.642283
Cabrera High School,Charter,1858,83.061895,83.975780,582.0,94.133477,97.039828,91.334769
Figueroa High School,District,2949,76.711767,81.158020,639.0,65.988471,80.739234,53.204476
Ford High School,District,2739,77.102592,80.746258,644.0,68.309602,79.299014,54.289887
Griffin High School,Charter,1468,83.351499,83.816757,625.0,93.392371,97.138965,90.599455
Hernandez High School,District,4635,77.289752,80.934412,652.0,66.752967,80.862999,53.527508
Holden High School,Charter,427,83.803279,83.814988,581.0,92.505855,96.252927,89.227166
Huang High School,District,2917,76.629414,81.182722,655.0,65.683922,81.316421,53.513884
Johnson High School,District,4761,77.072464,80.966394,650.0,66.057551,81.222432,53.539172
Pena High School,Charter,962,83.839917,84.044699,609.0,94.594595,95.945946,90.540541
Rodriguez High School,District,3999,76.842711,80.744686,637.0,66.366592,80.220055,52.988247
Shelton High School,Charter,1761,83.359455,83.725724,600.0,93.867121,95.854628,89.892107
Thomas High School,Charter,1635,83.418349,83.848930,638.0,93.272171,97.308869,90.948012
Wilson High School,Charter,2283,83.274201,83.989488,578.0,93.867718,96.539641,90.582567
Wright High School,Charter,1800,83.682222,83.955000,583.0,93.333333,96.611111,90.333333

In [ ]:
#School Summary
#Other methods
group=school.groupby('school_name')
total_students=group['Student ID'].count()
school_type=group.agg({'type': lambda x : x.unique()})
total_budget=group['budget'].sum()/group['budget'].count()
per_stu_budget=total_budget/total_students
avg_math_score=group['math_score'].mean()
avg_read_score=group['reading_score'].mean()

math_pass=school.loc[school.math_score >=70, ['school_name','math_score']]
perc_math_score=(math_pass.groupby('school_name')['math_score'].count()/group['math_score'].count())*100

read_pass=school.loc[school.reading_score >=70, ['school_name','reading_score']]
perc_read_score=(read_pass.groupby('school_name')['reading_score'].count()/group['reading_score'].count())*100

overall_pass=school.loc[(school.reading_score >=70) & (school.math_score >=70) , ['school_name','reading_score']]
perc_overall_score=(overall_pass.groupby('school_name')['reading_score'].count()/group['reading_score'].count())*100


school_summary=pd.DataFrame(school_type)
school_summary['Total Students']=total_students
school_summary['Total Budgets']=total_budget
school_summary['Per Student Budget']=per_stu_budget
school_summary['Average Math Score']=avg_math_score
school_summary['Average Reading Score']=avg_read_score
school_summary["% Passing Math"]=perc_math_score
school_summary["% Passing Reading"]=perc_read_score
school_summary["% Overall Passing"]=perc_overall_score

school_summary.rename(columns={'type': "School Type"}, inplace=True)
school_summary

In [ ]:
#Top Performing Schools (By % Overall Passing)
school_summary.sort_values('% Overall Passing', ascending=False, inplace=True)
school_summary

In [ ]:
#Bottom Performing Schools (By % Overall Passing)
school_summary.sort_values('% Overall Passing', ascending=True, inplace=True)
school_summary

In [ ]:
#Math Scores by Grade**

ninth_df1=school.loc[school.grade=='9th', ['school_name','math_score']]
nine_group1=ninth_df1.groupby('school_name')['math_score'].mean()

ten_df1=school.loc[school.grade=='10th', ['school_name','math_score']]
ten_group1=ten_df1.groupby('school_name')['math_score'].mean()

eleven_df1=school.loc[school.grade=='11th', ['school_name','math_score']]
eleven_group1=eleven_df1.groupby('school_name')['math_score'].mean()

twelve_df1=school.loc[school.grade=='12th', ['school_name','math_score']]
twelve_group1=twelve_df1.groupby('school_name')['math_score'].mean()


math_summary=pd.DataFrame(nine_group1)
math_summary['10th']=ten_group1
math_summary['11th']=eleven_group1
math_summary['12th']=twelve_group1
math_summary.rename(columns={'math_score': '9th'}, inplace=True)
math_summary

In [ ]:
#Reading Scores by Grade
ninth_df=school[school.grade=='9th']
nine_group=ninth_df.groupby('school_name')['reading_score'].mean()

ten_df=school[school.grade=='10th']
ten_group=ten_df.groupby('school_name')['reading_score'].mean()

eleven_df=school[school.grade=='11th']
eleven_group=eleven_df.groupby('school_name')['reading_score'].mean()

twelve_df=school[school.grade=='12th']
twelve_group=twelve_df.groupby('school_name')['reading_score'].mean()


reading_summary=(pd.DataFrame({'9th':nine_group,
                              "10th":ten_group,
                              "11th":eleven_group,
                            "12th":twelve_group}))
reading_summary

In [ ]:
#Scores by School Spending\group=school.groupby('school_name')

bins=[0, 585, 630, 645, 680]
labels=['<$585', '$585-630', '$630-645', '$645-680']
school_summary["Spending Ranges"]=pd.cut(school_summary["Per Student Budget"], bins, labels=labels)

math=(school_summary.groupby('Spending Ranges')
      [["Average Math Score", "Average Reading Score",
        "% Passing Math","% Passing Reading", "% Overall Passing" ]].mean())


math

In [ ]:
#Scores by School Size
bins1=[0, 1000, 2000, 5000]
labels1=['Small(<1000)', 'Medium(1000-2000)', 'Large(2000-5000)']
school_size=school.groupby('school_name')['size'].count()
school_summary['size']=school_size
school_summary["School Size"]=pd.cut(school_summary["size"], bins, labels=labels)


size=(school_summary.groupby('Spending Ranges')
      [["Average Math Score", "Average Reading Score",
        "% Passing Math","% Passing Reading", "% Overall Passing" ]].mean())

size

In [ ]:
#Scores by School Type
school_score=(school_summary.groupby('School Type')
      [["Average Math Score", "Average Reading Score",
        "% Passing Math","% Passing Reading", "% Overall Passing" ]].mean())
school_score